In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('opdata.csv')
print(df)

    id first_name    last_name                        email       gender
0    1      Ruddy       Ivakin             rivakin0@ftc.gov         Male
1    2    Winslow      Geertje         wgeertje1@tumblr.com         Male
2    3      Leroy      Heckney            lheckney2@hud.gov         Male
3    4      Aurie        Imlen        aimlen3@clickbank.net       Female
4    5     Oralee    Whitehall         owhitehall4@blog.com  Genderqueer
5    6      Luisa      Belshaw             lbelshaw5@nhs.uk       Female
6    7     Clemmy  Banaszewski   cbanaszewski6@usatoday.com   Non-binary
7    8     Godwin     Harberer       gharberer7@twitter.com         Male
8    9     Sisile       Spiers            sspiers8@narod.ru       Female
9   10     Maddie    Brazelton   mbrazelton9@bravesites.com       Female
10  11     Shawna     Redfield         sredfielda@desdev.cn       Female
11  12   Ethelred        Epine       eepineb@indiatimes.com         Male
12  13      Hinze        Harty       hhartyc@feedburner.com         Male
13  14      Jonas       Espasa                jespasad@g.co         Male
14  15     Floria     Macquire  fmacquiree@reverbnation.com       Female
15  16     Willow      Barosch         wbaroschf@paypal.com       Female
16  17       Roze       Whilde            rwhildeg@dmoz.org       Female
17  18     Mendie     Loughnan        mloughnanh@oracle.com         Male
18  19      Emmey       Durnan       edurnani@angelfire.com     Bigender
19  20     Gaynor      Swatten           gswattenj@yale.edu       Female

In [3]:
df.iloc[3]

id                                4
first_name                    Aurie
last_name                     Imlen
email         aimlen3@clickbank.net
gender                       Female
Name: 3, dtype: object

In [4]:
df.head()

   id first_name  last_name                  email       gender
0   1      Ruddy     Ivakin       rivakin0@ftc.gov         Male
1   2    Winslow    Geertje   wgeertje1@tumblr.com         Male
2   3      Leroy    Heckney      lheckney2@hud.gov         Male
3   4      Aurie      Imlen  aimlen3@clickbank.net       Female
4   5     Oralee  Whitehall   owhitehall4@blog.com  Genderqueer

In [5]:
df.tail(2)

    id first_name last_name                   email    gender
18  19      Emmey    Durnan  edurnani@angelfire.com  Bigender
19  20     Gaynor   Swatten      gswattenj@yale.edu    Female

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          20 non-null     int64
 1   first_name  20 non-null     object
 2   last_name   20 non-null     object
 3   email       20 non-null     object
 4   gender      20 non-null     object
dtypes: int64(1), object(4)
memory usage: 928.0+ bytes

In [8]:
df.shape

(20, 5)

In [10]:
df.describe()

             id
count  20.00000
mean   10.50000
std     5.91608
min     1.00000
25%     5.75000
50%    10.50000
75%    15.25000
max    20.00000